{
    "projects": [
        {
            "title": "Site de menus Ohmyfood",
            "description": "Pour le projet Ohmyfood, j'ai utilisé Sass qui permet d'étendre les fonctionnalités du langage CSS. La particularité de ce projet était le \"mobile first\" et la création de diverses animations comme un loader, des transitions dans l'apparition des menus ou encore des changements de style au survol de la souris. ",
            "img": "/projects/ohmyfood1.webp",
            "gallery": [
                "/projects/booki3.webp",
                "/projects/booki2.webp"
            ],
            "skills": [
                "HTML",
                "CSS",
                "SASS",
                "Mobile",
                "Animations"
            ],
            "link": "https://github.com/Voxalium/OC-IntegrateurWeb/tree/Projet-4/Projet-4/Ohmyfood"
        },
        {
            "title": "Site portfolio Sophie Buel",
            "description": "Pour ce projet, je devais créer le portfolio de Sophie Buel, une architecte d'intérieur. Je devais relier le backend et le frontend en récupérant diverse données depuis la base de données. Le site devait comporter un système de filtrage des photos, la possibilité de se connecter/déconnecter et l'ajout de nouvelles photos grâce à un formulaire.",
            "img": "/projects/sophiebuel1.webp",
            "skills": [
                "HTML",
                "CSS",
                "Javascript"
            ],
            "gallery": [
                "/projects/booki2.webp"
            ],
            "link": "https://github.com/Voxalium/OC-IntegrateurWeb/tree/Projet-6/Projet-6/Portfolio-Sophie-Buel"
        },
        {
            "title": "Site Menu Maker",
            "description": "Menu Maker est un site de création de menu pour restaurateur. Mon travail consistait à planifier le développement de ce site en créant différents documents comme la solution technique, les spécificités techniques et une veille technologique.",
            "img": "/projects/menumaker1.webp",
            "skills": [
                "Veille",
                "Gestion",
                "Doc technique"
            ]
        },
        {
            "title": "Site portfolio Nina Carducci",
            "description": "Pour ce projet, j'ai appris à faire des audits avec Lighthouse pour faire un diagnostique des performances du site afin d'opérer des diverses optimisations. J'ai notamment compressé et réduit la taille des fichiers image et texte, ajouter les balises \"meta\" pour les réseaux sociaux et Google Rich Snippet.",
            "img": "/projects/ninacarducci1.webp",
            "skills": [
                "Optimisation",
                "SEO"
            ],
            "link": "https://github.com/Voxalium/OC-IntegrateurWeb/tree/Projet-9/Projet-9/ninacarducci"
        },
        {
            "title": "Site 724events",
            "description": "724events est un site d'événementiel. Je devais corriger un certain nombre de bugs. Le carrousel du site, le système de filtrage et l'envoie de message du formulaire de contact ne fonctionnaient pas comme convenu. De plus quelques élément ne s'affichaient pas. J'ai appris à débugger un site et à mettre en place différents tests avec Jest.",
            "img": "/projects/724events.webp",
            "skills": [
                "Debug",
                "Test",
                "JEST"
            ],
            "link": "https://github.com/Voxalium/OC-IntegrateurWeb/tree/Projet-10/Projet-10/Debuggez-une-application-React.JS"
        },
        {
            "title": "Application bancaire Argent Bank",
            "description": "Argent bank est une application de banque en ligne. Une maquette en HTML et CSS m'avait été fourni et je devais refaire le site avec React. On devait avoir la possibilité de se connecter et d'afficher certaines informations de l'utilisateur avec le store Redux. J'ai aussi appris à faire une documentation Swagger en Yaml pour définir de nouvelles routes. ",
            "img": "/projects/argentbank.webp",
            "skills": [
                "React",
                "API",
                "Redux",
                "Mongo",
                "Swagger"
            ],
            "link": "https://github.com/Voxalium/OC-IntegrateurWeb/tree/Projet-11/Projet-11/ArgentBank-website"
        }
    ],
    "perso": [
        {
            "title": "Site de photographe",
            "description": "Angular et php",
            "img": "",
            "skills": [
                "Angular",
                "TypeScript",
                "PHP",
                "SASS",
                "Mongo"
            ]
        }
    ]
}
